{"netflix":"2008","content":[{"country":"United States","title":"Vantage Point","rating":"PG-13","date_added":"November 1, 2019","show_id":"70060005","duration":"90 min","cast":"Dennis Quaid, Matthew Fox, Forest Whitaker, Bruce McGill, Edgar Ramírez, Saïd Taghmaoui, Ayelet Zurer, Zoe Saldana, Sigourney Weaver, William Hurt","description":"Moments after he arrives in Spain for an antiterrorism summit, U.S. President Ashton is shot.","listed_in":"Action & Adventure","release_year":"2008","director":"Pete Travis","type":"Movie"},{"show_id":"70060018","date_added":"June 1, 2019","description":"Fierce mammoth hunter D'Leh sets out on an impossible journey to rescue the woman he loves from a vicious warlord and save the people of his village.","duration":"109 min","cast":"Steven Strait, Camilla Belle, Cliff Curtis, Joel Virgel, Affif Ben Badra, Mo Zinal, Nathanael Baring, Mona Hammond, Omar Sharif","title":"10,000 B.C.","rating":"PG-13","release_year":"2008","listed_in":"Action & Adventure","country":"United States, South Africa","director":"Roland Emmerich","type":"Movie"},{"show_id":"70077556","duration":"97 min","release_year":"2008","title":"The Spiderwick Chronicles","date_added":"March 1, 2019","type":"Movie","country":"United States","listed_in":"Children & Family Movies","cast":"Freddie Highmore, Mary-Louise Parker, Sarah Bolger, Joan Plowright, David Strathairn, Nick Nolte, Seth Rogen, Andrew McCarthy, Martin Short","rating":"PG","director":"Mark Waters","description":"When city-raised twins move to a tumbledown country mansion, it's quite an adjustment – especially after they uncover a magical fantasy world."},{"director":"Peter Segal","date_added":"April 1, 2019","title":"Get Smart","country":"United States","release_year":"2008","rating":"PG-13","show_id":"70077557","description":"When the identities of secret agents are compromised, hapless Maxwell Smart teams with far more capable Agent 99 to thwart an evil terrorist group.","listed_in":"Action & Adventure, Comedies","type":"Movie","cast":"Steve Carell, Anne Hathaway, Dwayne Johnson, Alan Arkin, Terence Stamp, Terry Crews, David Koechner, James Caan, Masi Oka, Nate Torrence, Bill Murray","duration":"110 min"},{"description":"A woman joins the janitorial staff of the Federal Reserve Bank and conspires with two co-workers to pilfer old money that's scheduled to be destroyed.","title":"Mad Money","date_added":"November 1, 2019","listed_in":"Comedies","rating":"PG-13","show_id":"70082264","cast":"Diane Keaton, Queen Latifah, Katie Holmes, Ted Danson, Roger Cross, Adam Rothenberg, Stephen Root, Christopher McDonald, Meagen Fay, J.C. MacKenzie, Finesse Mitchell, Eric Keenleyside","director":"Callie Khouri, Jesse V. Johnson","release_year":"2008","duration":"99 min","type":"Movie","country":"United States"},{"show_id":"70082268","rating":"PG-13","director":"Matt Reeves","type":"Movie","title":"Cloverfield","date_added":"January 1, 2020","description":"A going-away party in Manhattan is interrupted when a mysterious monster of epic proportions launches an attack on New York City.","country":"United States","duration":"85 min","release_year":"2008","cast":"Lizzy Caplan, Jessica Lucas, T.J. Miller, Michael Stahl-David, Mike Vogel, Odette Annable, Anjul Nigam, Margot Farley, Theo Rossi, Brian Klugman","listed_in":"Action & Adventure, Horror Movies, Sci-Fi & Fantasy"},{"listed_in":"Comedies, Cult Movies","director":"Jon Hurwitz, Hayden Schlossberg","date_added":"October 1, 2019","cast":"John Cho, Kal Penn, Rob Corddry, Jack Conley, Roger Bart, Neil Patrick Harris, Danneel Ackles, Eric Winter, Paula Garcés, Jon Reep, Missi Pyle","type":"Movie","show_id":"70083108","duration":"101 min","description":"Harold and Kumar jump on a plane to catch up with Harold's love interest but must change their plans when Kumar is accused of being a terrorist.","title":"Harold & Kumar Escape from Guantanamo Bay","release_year":"2008","rating":"R","country":"United States"},{"show_id":"70084148","country":"United States","date_added":"July 1, 2019","duration":"97 min","director":"Courtney Hunt","title":"Frozen River","description":"On a Mohawk reservation on the Canadian border, Ray Eddy teams with a widowed tribe member to smuggle illegal immigrants into the United States.","listed_in":"Dramas, Independent Movies","release_year":"2008","rating":"R","type":"Movie","cast":"Melissa Leo, Misty Upham, Charlie McDermott, Michael O'Keefe, Mark Boone Junior, James Reilly, Jay Klaitz, John Canoe, Dylan Carusona, Michael Sky"},{"listed_in":"Comedies, Dramas, Independent Movies","type":"Movie","rating":"R","country":"United States","date_added":"July 12, 2019","director":"Noam Murro","cast":"Dennis Quaid, Sarah Jessica Parker, Thomas Haden Church, Ellen Page, Ashton Holmes, Christine Lahti, Camille Mana, David Denman, Don Wadsworth, Robert Haley","show_id":"70084221","duration":"95 min","release_year":"2008","description":"An unexpected romance and a surprise visit from his wild brother turn the life of widowed professor Lawrence Wetherhold upside down.","title":"Smart People"},{"cast":"Jim Sturgess, Kevin Spacey, Kate Bosworth, Aaron Yoo, Liza Lapira, Jacob Pitts, Laurence Fishburne, Jack McGee, Josh Gad, Sam Golzari, Helen Carey, Jack Gilpin","director":"Robert Luketic","title":"21","listed_in":"Dramas","country":"United States","rating":"PG-13","release_year":"2008","type":"Movie","show_id":"70084788","date_added":"January 1, 2020","duration":"123 min","description":"A brilliant group of students become card-counting experts with the intent of swindling millions out of Las Vegas casinos by playing blackjack."},{"show_id":"70084791","cast":"Emma Roberts, Kimberley Nixon, Juno Temple, Linzey Cocker, Sophie Wu, Alex Pettyfer, Georgia King, Natasha Richardson, Aidan Quinn, Lexi Ainsworth","duration":"98 min","country":"United States, United Kingdom, France","description":"When a spoiled girl pushes her father too far with her spending and outlandish behavior, he ships the Malibu princess off to a strict boarding school.","date_added":"November 1, 2019","director":"Nick Moore","title":"Wild Child","listed_in":"Comedies, Romantic Movies","type":"Movie","rating":"PG-13","release_year":"2008"},{"cast":"Jackie Chan, Jet Li, Collin Chou, Liu Yifei, Li Bingbing, Michael Angarano, Morgan Benoit, Juana Collignon, Wang Deshun, Thomas McDonell","release_year":"2008","description":"Jackie Chan and Jet Li star in this rousing adventure about a martial arts movie fan who finds a mystical staff that transports him to ancient China.","rating":"PG-13","show_id":"70084795","country":"United States, China","title":"The Forbidden Kingdom","director":"Rob Minkoff","listed_in":"Action & Adventure, Sci-Fi & Fantasy","type":"Movie","duration":"104 min","date_added":"July 1, 2019"},{"show_id":"70084799","release_year":"2008","country":"United States","rating":"PG-13","cast":"Harrison Ford, Cate Blanchett, Karen Allen, Ray Winstone, John Hurt, Jim Broadbent, Igor Jijikine, Shia LaBeouf","director":"Steven Spielberg","title":"Indiana Jones and the Kingdom of the Crystal Skull","duration":"123 min","type":"Movie","description":"Indiana Jones is drawn into a Russian plot to unearth the Crystal Skulls of Akator, Amazonian artifacts with supernatural powers.","listed_in":"Action & Adventure, Children & Family Movies, Sci-Fi & Fantasy","date_added":"January 1, 2019"},{"release_year":"2008","rating":"PG-13","cast":"Mike Myers, Jessica Alba, Justin Timberlake, Ben Kingsley, Romany Malco, Meagan Good, Verne Troyer, Omid Djalili, Telma Hopkins","type":"Movie","title":"The Love Guru","duration":"87 min","description":"Raised on an ashram in India, a self-styled love guru returns to his native America to settle a romantic rivalry between two pro hockey players.","country":"United Kingdom, Germany, United States","date_added":"November 20, 2019","director":"Marco Schnabel","show_id":"70087538","listed_in":"Comedies, Sports Movies"},{"title":"You Don't Mess with the Zohan","country":"United States","description":"An Israeli counterterrorism soldier with a secretly fabulous ambition to become a Manhattan hairstylist will do anything to make his dreams come true.","date_added":"September 1, 2019","type":"Movie","cast":"Adam Sandler, John Turturro, Emmanuelle Chriqui, Nick Swardson, Lainie Kazan, Ido Mosseri, Rob Schneider, Dave Matthews, Michael Buffer, Charlotte Rae","director":"Dennis Dugan","listed_in":"Action & Adventure, Comedies","show_id":"70087541","release_year":"2008","duration":"113 min","rating":"UR"},{"description":"Soft-spoken Jai and spitfire beauty Aditi couldn't be more different – but their family and friends know that they're a perfect match.","date_added":"December 8, 2017","rating":"TV-PG","duration":"147 min","type":"Movie","release_year":"2008","country":"India","title":"Jaane Tu... Ya Jaane Na","listed_in":"Comedies, International Movies, Music & Musicals","director":"Abbas Tyrewala","cast":"Imran Khan, Genelia D'souza, Manjari Fadnis, Ayaz Khan, Karan Makhija, Sugandha Garg, Nirav Mehta, Alishka Varde, Renuka Kunzru, Prateik Babbar, Ratna Pathak Shah","show_id":"70089214"},{"country":"India","date_added":"October 1, 2018","rating":"TV-14","type":"Movie","title":"Jodhaa Akbar","description":"In 16th-century India, what begins as a strategic alliance between a Mughal emperor and a Hindu princess becomes a genuine opportunity for true love.","release_year":"2008","duration":"214 min","director":"Ashutosh Gowariker","listed_in":"Action & Adventure, Dramas, International Movies","cast":"Hrithik Roshan, Aishwarya Rai Bachchan, Sonu Sood, Poonam Sinha, Suhasini Mulay, Ila Arun, Raza Murad, Kulbhushan Kharbanda, Abeer Abrar","show_id":"70090035"},{"duration":"56 min","cast":"Mike Birbiglia","date_added":"November 22, 2019","title":"Mike Birbiglia: What I Should Have Said Was Nothing: Tales from My Secret Public Journal","listed_in":"Stand-Up Comedy","type":"Movie","show_id":"70091304","release_year":"2008","rating":"TV-14","director":"","country":"United States","description":"Mike Birbiglia performs in this live concert special that features a riotous selection of the unique insights and observations culled from his diary."},{"director":"Adam McKay","type":"Movie","listed_in":"Comedies","date_added":"November 1, 2019","country":"United States","description":"Brennan and Dale might be grown men, but that doesn't stop a childish sibling rivalry from erupting after Brennan's mom marries Dale's dad.","rating":"R","duration":"98 min","cast":"Will Ferrell, John C. Reilly, Mary Steenburgen, Richard Jenkins, Adam Scott, Kathryn Hahn, Andrea Savage, Lurie Poston, Elizabeth Yozamp, Logan Manus, Rob Riggle","title":"Step Brothers","show_id":"70093991","release_year":"2008"},{"rating":"TV-14","title":"Race","director":"Mastan Alibhai Burmawalla, Abbas Alibhai Burmawalla","date_added":"October 1, 2018","show_id":"70096752","type":"Movie","release_year":"2008","country":"India","description":"The plot thickens around two horse-racing competitors when three beautiful women come into their lives and a murder is committed.","cast":"Saif Ali Khan, Akshaye Khanna, Katrina Kaif, Bipasha Basu, Anil Kapoor, Sameera Reddy","listed_in":"Action & Adventure, International Movies, Music & Musicals","duration":"155 min"},{"show_id":"70098332","type":"Movie","listed_in":"Dramas, Thrillers","description":"An FBI agent assigned to pursue an ex-Special Ops soldier who joined a terrorist organization begins to question his target's true intentions.","release_year":"2008","country":"United States","director":"Jeffrey Nachmanoff","cast":"Don Cheadle, Guy Pearce, Saïd Taghmaoui, Neal McDonough, Alyy Khan, Archie Panjabi, Raad Rawi, Jeff Daniels, Lorena Gale, Simon Reynolds, Jonathan Walker, Mozhan Marnò, Tom Barnett, Scali Delpeyrat","duration":"114 min","rating":"PG-13","title":"Traitor","date_added":"July 1, 2018"},{"country":"United States","rating":"R","title":"Righteous Kill","release_year":"2008","show_id":"70098605","listed_in":"Dramas, Thrillers","date_added":"June 1, 2019","description":"Two detectives investigate a rash of vigilante killings linked to an old case, suggesting they might have put an innocent man behind bars.","type":"Movie","director":"Jon Avnet","cast":"Robert De Niro, Al Pacino, 50 Cent, Carla Gugino, John Leguizamo, Donnie Wahlberg, Brian Dennehy, Trilby Glover","duration":"101 min"},{"type":"Movie","cast":"Richard Gere, Diane Lane, Christopher Meloni, Viola Davis, Becky Ann Baker, Scott Glenn, Linda Molloy, Pablo Schreiber, Mae Whitman, Charlie Tahan","release_year":"2008","date_added":"July 1, 2019","country":"United States, Australia","description":"When a hurricane hits a coastal North Carolina inn and strands the only guest, surgeon Paul Flanner, a young woman's life changes forever.","show_id":"70098899","director":"George C. Wolfe","title":"Nights in Rodanthe","rating":"PG-13","duration":"97 min","listed_in":"Dramas, Romantic Movies"},{"duration":"119 min","show_id":"70098902","rating":"PG-13","description":"A college professor goes up against the giants of the auto industry when they fail to give him credit for inventing intermittent windshield wipers.","title":"Flash of Genius","director":"Marc Abraham","cast":"Greg Kinnear, Lauren Graham, Dermot Mulroney, Alan Alda, Bill Smitrovich, Mitch Pileggi, Daniel Roebuck, Tim Kelleher, Aaron Abrams, Chuck Shamata, Andrew Gillies","type":"Movie","release_year":"2008","listed_in":"Dramas","date_added":"January 16, 2017","country":"Canada, United States"},{"type":"Movie","director":"Kevin Smith","show_id":"70099118","rating":"R","cast":"Seth Rogen, Elizabeth Banks, Craig Robinson, Jason Mewes, Jeff Anderson, Traci Lords, Katie Morgan, Ricky Mabe, Justin Long, Brandon Routh, Tyler Labine, Tom Savini, Tisha Campbell-Martin, Jennifer Schwalbach, Gerry Bednob","title":"Zack and Miri Make a Porno","description":"Zack and Miri make and star in an adult film to bring in easy money. But their unspoken feelings for each other might threaten the whole enterprise.","listed_in":"Comedies, Independent Movies, Romantic Movies","duration":"101 min","release_year":"2008","date_added":"October 1, 2018","country":"United States"},{"director":"Tony Leondis","country":"United States, France","duration":"87 min","rating":"PG","show_id":"70099119","description":"Igor, the brilliant but deformed assistant to mad Dr. Glickenstein, dreams of winning the Evil Science Fair and the heart of village beauty Gretchen.","listed_in":"Children & Family Movies","date_added":"September 1, 2019","release_year":"2008","cast":"John Cusack, Steve Buscemi, Sean Hayes, Molly Shannon, Eddie Izzard, Jennifer Coolidge, Jay Leno","type":"Movie","title":"Igor"},{"date_added":"January 30, 2019","country":"United States","type":"Movie","cast":"Ice Cube, Keke Palmer, Tasha Smith, Jill Marie Jones, Dash Mihok, Matt Craven, Glenn Plummer, Garrett Morris, Miles Chandler, Malcolm Goodwin","rating":"PG","show_id":"70099120","listed_in":"Comedies, Dramas, Sports Movies","duration":"95 min","release_year":"2008","description":"When an 11-year-old girl becomes Pop Warner football's first female quarterback, she raises eyebrows – till she takes her team to the brink of glory.","director":"Fred Durst","title":"The Longshots"},{"country":"United Kingdom, Italy, France, United States","date_added":"April 1, 2018","release_year":"2008","cast":"Keira Knightley, Ralph Fiennes, Charlotte Rampling, Dominic Cooper, Hayley Atwell, Simon McBurney, Aidan McArdle, John Shrapnel, Alistair Petrie, Patrick Godfrey","description":"To compensate for her unhappy marriage, young duchess Georgiana Spencer begins a scandalous affair with politician Charles Grey.","type":"Movie","director":"Saul Dibb","rating":"PG-13","title":"The Duchess","show_id":"70099610","listed_in":"Dramas, International Movies, Romantic Movies","duration":"110 min"},{"country":"United States","release_year":"2008","director":"Byron Howard, Chris Williams","rating":"PG","listed_in":"Children & Family Movies, Comedies","cast":"John Travolta, Miley Cyrus, Susie Essman, Mark Walton, Malcolm McDowell, James Lipton, Greg Germann, Diedrich Bader, Nick Swardson, J.P. Manoux, Dan Fogelman, Kari Wahlgren, Chloë Grace Moretz, Randy Savage, Ronn Moss, John DiMaggio, Daran Norris, Jeff Bennett, Brian Stepanek, Todd Cummings","title":"Bolt","type":"Movie","show_id":"70099615","duration":"99 min","description":"This tale follows German shepherd Bolt, a canine actor who makes a cross-country trek when he's mistakenly shipped from Hollywood to New York City.","date_added":"July 22, 2018"},{"country":"India","date_added":"March 1, 2018","description":"Courtroom intrigue plays out against a backdrop of military secrets in this Bollywood drama with a plot that's reminiscent of A Few Good Men.","title":"Shaurya: It Takes Courage to Make Right... Right","cast":"Rahul Bose, Javed Jaffrey, Minissha Lamba, Seema Biswas, Deepak Dobriyal, Kay Kay Menon, Amrita Rao, Rosa Catalano, Subrat Dutta, Priyesh Kaushik","release_year":"2008","director":"Samar Khan","duration":"135 min","type":"Movie","rating":"TV-14","show_id":"70099702","listed_in":"Dramas, International Movies"},{"duration":"128 min","type":"Movie","date_added":"February 16, 2017","release_year":"2008","country":"United States","rating":"R","title":"Milk","cast":"Sean Penn, Emile Hirsch, Josh Brolin, Diego Luna, James Franco, Alison Pill, Victor Garber, Denis O'Hare, Joseph Cross, Stephen Spinella, Lucas Grabeel, Brandon Boyce","listed_in":"Dramas, Independent Movies, LGBTQ Movies","show_id":"70100084","description":"Sean Penn stars in this biopic about Harvey Milk, the openly gay San Francisco politician who was murdered by a disgruntled city supervisor in 1978.","director":"Gus Van Sant"},{"duration":"104 min","release_year":"2008","director":"John Patrick Shanley","cast":"Meryl Streep, Philip Seymour Hoffman, Amy Adams, Viola Davis, Alice Drummond, Audrie Neenan, Susan Blommaert, Carrie Preston, Lydia Jordan, Lloyd Clay Brown","title":"Doubt","listed_in":"Dramas, Faith & Spirituality","rating":"PG-13","type":"Movie","country":"United States","show_id":"70100377","date_added":"March 7, 2019","description":"Sister Aloysius begins to have doubts about doting Father Flynn, who seems to have become overly involved in the life of an African American pupil."},{"release_year":"2008","type":"Movie","show_id":"70100379","date_added":"January 1, 2020","director":"Peyton Reed","title":"Yes Man","cast":"Jim Carrey, Zooey Deschanel, Bradley Cooper, John Michael Higgins, Rhys Darby, Danny Masterson, Fionnula Flanagan, Terence Stamp, Sasha Alexander, Molly Sims","duration":"104 min","rating":"PG-13","description":"After a bitter divorce, a bank drone falls under the sway of a self-help guru who urges him to say yes to everything that comes his way for a year.","country":"United States, United Kingdom","listed_in":"Comedies, Romantic Movies"},{"type":"Movie","description":"Skeeter's life is turned upside down when the fantastical stories he makes up to entertain his niece and nephew inexplicably turn into reality.","country":"United States","director":"Adam Shankman","duration":"100 min","release_year":"2008","date_added":"March 5, 2019","rating":"PG","show_id":"70100381","listed_in":"Children & Family Movies, Comedies","title":"Bedtime Stories","cast":"Adam Sandler, Keri Russell, Guy Pearce, Russell Brand, Richard Griffiths, Jonathan Pryce, Courteney Cox, Lucy Lawless, Teresa Palmer, Aisha Tyler, Laura Ann Kesling, Jackie Sandler, Lorna Scott, Dana Min Goodman, Andrew Collins, Jonathan Loughran, Jonathan Morgan Heit, Nick Swardson, Tim Herlihy, Billy Tyler, Johntae Lipscomb, Mikey Post, Sebastian Saraceno, Bill Romanowski, Sadie Sandler, Carmen Electra, Allen Covert, Kathryn Joosten, Annalise Basso, Blake Clark, Julia Lea Wolov, Sarah G. Buxton"},{"date_added":"November 1, 2019","listed_in":"Dramas, Romantic Movies","cast":"Leonardo DiCaprio, Kate Winslet, Kathy Bates, Michael Shannon, Kathryn Hahn, David Harbour, Dylan Baker, Richard Easton, Zoe Kazan, Jay O. Sanders, Max Casella","rating":"R","duration":"120 min","description":"April and Frank's marriage unravels when a plan to change their \"perfect\" lives becomes their last hope to escape lives engulfed in emptiness.","title":"Revolutionary Road","release_year":"2008","show_id":"70100383","director":"Sam Mendes","country":"United States, United Kingdom","type":"Movie"},{"rating":"R","director":"James Toback","show_id":"70100412","type":"Movie","description":"In this surprisingly emotional documentary, heavyweight champ Mike Tyson analyzes the controversies surrounding his career and turbulent private life.","title":"Tyson","release_year":"2008","duration":"90 min","cast":"Mike Tyson, Trevor Berbick","country":"United States, France","date_added":"March 1, 2019","listed_in":"Documentaries, Sports Movies"},{"date_added":"January 1, 2020","show_id":"70100448","country":"United States, South Korea","type":"Movie","listed_in":"Children & Family Movies, Comedies","rating":"TV-Y7","release_year":"2008","director":"Mark A.Z. Dippé, Eondeok Han","description":"Garfield has long been the champ at a yearly competition for the funniest comic strip. But this time, Garfield must battle tall, handsome Ramone.","duration":"79 min","title":"Garfield's Fun Fest","cast":"Frank Welker, Tim Conway, Gregg Berger, Wally Wingert, Audrey Wasilewski, Fred Tatasciore, Stephen Stanton, Jennifer Darling, Neil Ross, Greg Eagles"},{"type":"Movie","duration":"95 min","director":"Raj Kumar Gupta","release_year":"2008","show_id":"70100644","country":"India","description":"In this high-tension thriller, an anonymous caller on a cell phone threatens to harm a man's family if he doesn't carry out every order.","listed_in":"International Movies, Thrillers","cast":"Rajeev Khandelwal, Gajraj Rao, Shashanka Ghosh, Jhilmil Hazrika, Gazala Amin, Allauddin Khan","date_added":"November 1, 2018","title":"Aamir","rating":"TV-14"},{"duration":"145 min","date_added":"October 1, 2018","rating":"TV-PG","country":"India","cast":"Shahid Kapoor, Vidya Balan, Juhi Chawla, Om Puri, Vishal Malhotra, Karanvir Bohra, Amit Varma","show_id":"70101039","type":"Movie","title":"Kismat Konnection","release_year":"2008","listed_in":"Comedies, International Movies, Music & Musicals","description":"A man finds his lucky charm in the form of a woman whom he had once clashed with on every level, but on whose presence he must now rely to succeed.","director":"Aziz Mirza"},{"director":"Iain Softley","date_added":"July 1, 2019","rating":"PG","title":"Inkheart","description":"Unbeknownst to his 12-year-old daughter, a bookbinder has a secret ability to bring characters to life by reading their stories out loud.","duration":"106 min","country":"Germany, United Kingdom, United States","cast":"Brendan Fraser, Paul Bettany, Helen Mirren, Jim Broadbent, Andy Serkis, Sienna Guillory, Eliza Bennett, Rafi Gavron, Lesley Sharp, Jamie Foreman","type":"Movie","listed_in":"Action & Adventure, Children & Family Movies, Sci-Fi & Fantasy","show_id":"70101345","release_year":"2008"},{"description":"When his family moves from Berlin to Poland, a young boy befriends a boy who lives on the other side of the fence, unaware he's a Jewish prisoner.","duration":"95 min","listed_in":"Dramas, Independent Movies, International Movies","release_year":"2008","date_added":"January 1, 2019","rating":"PG-13","show_id":"70101375","cast":"Asa Butterfield, Vera Farmiga, David Thewlis, Rupert Friend, David Hayman, Jack Scanlon, Amber Beattie, Sheila Hancock, Richard Johnson, Jim Norton","director":"Mark Herman","type":"Movie","title":"The Boy in the Striped Pajamas","country":"United Kingdom, United States"},{"cast":"Daniel Craig, Liev Schreiber, Jamie Bell, Alexa Davalos, Allan Corduner, Mark Feuerstein, Tomas Arana, Jodhi May, Kate Fahy, Iddo Goldberg, George MacKay, Iben Hjejle, Martin Hancock, Jacek Koman, Ravil Isyanov","release_year":"2008","director":"Edward Zwick","title":"Defiance","listed_in":"Action & Adventure, Dramas","date_added":"November 27, 2019","description":"In this action-packed drama based on an extraordinary true story, four brothers protect more than 1,000 Jewish refugees during World War II.","rating":"R","type":"Movie","duration":"137 min","show_id":"70101696","country":"United States"},{"description":"Weighed down by a dark secret, IRS agent Ben Thomas tries to improve the lives of seven strangers in need of a second chance.","cast":"Will Smith, Rosario Dawson, Woody Harrelson, Michael Ealy, Barry Pepper, Elpidia Carrillo, Robinne Lee, Joe Nunez, Bill Smitrovich, Tim Kelleher, Gina Hecht, Andy Milder, Judyann Elder, Sarah Jane Morris","director":"Gabriele Muccino","type":"Movie","title":"Seven Pounds","date_added":"December 1, 2018","release_year":"2008","country":"United States","duration":"123 min","listed_in":"Dramas, Romantic Movies","rating":"PG-13","show_id":"70104313"},{"listed_in":"Horror Movies, Thrillers","date_added":"October 4, 2018","show_id":"70105130","description":"A troubled teenage girl hopes to start fresh at a new school, but the horrifying truth about her past is destined to catch up with her.","title":"The Haunting of Molly Hartley","rating":"PG-13","director":"Mickey Liddell","country":"United States","duration":"85 min","type":"Movie","release_year":"2008","cast":"Haley Bennett, Jake Weber, Chace Crawford, Shannon Woodward, Shanna Collins, AnnaLynne McCord, Marin Hinkle, Nina Siemaszko, Josh Stewart, Jessica Lowndes, Randy Wayne"},{"type":"Movie","title":"R.L. Stine's Mostly Ghostly","cast":"Madison Pettis, Sterling Beaumon, Luke Benward, Brian Stepanek, David DeLuise, Kim Rhodes, Adam Hicks, Ali Lohan, Sabrina Bryan, Rachel Winfree, Diego Acuña","date_added":"August 1, 2018","release_year":"2008","rating":"PG","listed_in":"Children & Family Movies, Comedies","duration":"98 min","country":"United States","director":"Richard Correll","description":"After discovering a pair of young ghosts, a nebbish 11-year-old agrees to help the sibling spirits solve the mystery surrounding their demise.","show_id":"70105338"},{"duration":"113 min","release_year":"2008","type":"Movie","cast":"Anne Hathaway, Rosemarie DeWitt, Debra Winger, Bill Irwin, Tunde Adebimpe, Mather Zickel, Anna Deavere Smith, Anisa George, Robyn Hitchcock, Sister Carol East, Sebastian Stan","show_id":"70105368","director":"Jonathan Demme","date_added":"September 1, 2019","listed_in":"Dramas, Independent Movies","rating":"R","title":"Rachel Getting Married","description":"Longstanding family conflicts resurface when a former model who's been in and out of rehab for a decade returns home for her sister's wedding.","country":"United States"},{"director":"Ram Gopal Varma","release_year":"2008","rating":"TV-MA","title":"Contract","listed_in":"Action & Adventure, Dramas, Independent Movies","duration":"116 min","date_added":"March 2, 2019","description":"Following the death of his wife and daughter in a terrorist attack, an ex-Indian army commando agrees to infiltrate a terrorist cell.","country":"India","show_id":"70105459","cast":"Adhvik Mahajan, Prasad Purandhare, Sakshi Gulati, Zakir Hussain, Amruta Subhash, Kishore Kadam, Sumeet Nijhawan, Upyendra Limaye","type":"Movie"},{"show_id":"70105699","release_year":"2008","rating":"TV-14","listed_in":"Action & Adventure, Anime Features, International Movies","duration":"93 min","country":"Japan","description":"When strange ninjas ambush the village of Konohagakure, it's up to adolescent ninja Naruto and his long-missing pal, Sasuke, to save the planet.","title":"Naruto Shippûden the Movie: Bonds","type":"Movie","cast":"Junko Takeuchi, Noriaki Sugiyama, Chie Nakamura, Kazuhiko Inoue, Satoshi Hino, Shinji Kawada, Nana Mizuki, Showtaro Morikubo, Rikiya Koyama, Motoko Kumai, Unsho Ishizuka","date_added":"October 15, 2016","director":"Hajime Kamegaki"},{"title":"Mumbai Meri Jaan","country":"India","type":"Movie","date_added":"November 1, 2018","description":"A moving portrayal of the 2006 train bombings in Mumbai, this Indian drama follows the interconnected stories of several strangers.","listed_in":"Dramas, International Movies","show_id":"70106268","release_year":"2008","director":"Nishikant Kamat","duration":"135 min","cast":"Madhavan, Irrfan Khan, Soha Ali Khan, Paresh Rawal, Kay Kay Menon, Anand Goradia, Vijay Maurya, Vibhavari Deshpande, Santosh Juvekar, Kamlesh Sawant","rating":"TV-MA"},{"date_added":"November 1, 2018","cast":"Anupam Kher, Naseeruddin Shah, Jimmy Shergill, Deepal Shaw, Aamir Bashir, Kali Prasad Mukherjee, Vijay Bhatia, Chetan Pandit","director":"Neeraj Pandey","show_id":"70107499","listed_in":"Action & Adventure, Dramas, International Movies","release_year":"2008","duration":"103 min","country":"India","rating":"TV-MA","title":"A Wednesday","description":"After receiving an anonymous tip about a bomb, a police commissioner must negotiate with the terrorist, who demands the release of four militants.","type":"Movie"},{"show_id":"70108590","director":"Shyam Benegal","date_added":"November 1, 2018","listed_in":"Comedies, Dramas, International Movies","description":"An educated man assists the illiterate residents of his village with written correspondence, sometimes manipulating the letters to suit his interests.","country":"India","cast":"Shreyas Talpade, Amrita Rao, Ravi Kishan, Ila Arun, Rajeshwari Sachdev, Divya Dutta, Yashpal Sharma, Ravi Jhankal, Lalit Mohan Tiwari","title":"Welcome to Sajjanpur","type":"Movie","rating":"TV-PG","release_year":"2008","duration":"131 min"},{"title":"C Kkompany","country":"India","show_id":"70109249","duration":"127 min","rating":"TV-14","director":"Sachin Yardi","release_year":"2008","date_added":"May 31, 2019","listed_in":"Action & Adventure, Comedies, International Movies","type":"Movie","description":"To blow off some steam, friends Akshay, Joshi and Lambodar, posing as a gang called C Kkompany, make a phony extortion demand to Joshi's apathetic son. The trio is shocked when their prank call makes them anonymous celebrities.","cast":"Mahesh Bhatt, Mithun Chakraborty, G.K. Desai, Celina Jaitly, Karan Johar, Ekta Kapoor, Tusshar Kapoor, Anupam Kher, Ashok Pandit, Lalit Parashar, Raima Sen, Rajpal Yadav"},{"release_year":"2008","title":"Mission Istaanbul: Darr Ke Aagey Jeet Hai","type":"Movie","duration":"119 min","show_id":"70109375","country":"India","date_added":"May 16, 2019","cast":"Vivek Oberoi, Zayed Khan, Shriya Saran, Nikitin Dheer, Shabbir Ahluwalia, Sunil Shetty, Shweta Bhardwaj","listed_in":"Action & Adventure, International Movies, Music & Musicals","director":"Apoorva Lakhia","rating":"TV-MA","description":"A television journalist makes a risky career move by accepting a job offer from a controversial Istanbul television station."},{"director":"Sachin Kamlakar Khot","release_year":"2008","description":"Everyday guy Kabir is thrown for a loop when he meets Kuhu, a freewheeling party girl. Now, he's a changed man, dancing, running half-naked through the streets and donning ladies' shoes at her whim.","duration":"115 min","date_added":"February 15, 2019","rating":"TV-14","cast":"Mallika Sherawat, Ranvir Shorey, Tinnu Anand, Sushmita Mukherjee, Manish Anand, Vihang Nayak, Bharati Achrekar, Zeenat Aman","show_id":"70109378","country":"India","type":"Movie","title":"Ugly Aur Pagli","listed_in":"Comedies, International Movies, Romantic Movies"},{"release_year":"2008","rating":"TV-MA","country":"United States","duration":"85 min","title":"Jeff Dunham's Very Special Christmas Special","show_id":"70109657","listed_in":"Stand-Up Comedy","director":"Michael Simon","description":"Politically incorrect, sometimes raunchy ventriloquist Jeff Dunham is joined by his irreverent cast of characters in this hilarious Christmas special.","cast":"Jeff Dunham, Brian Haner","type":"Movie","date_added":"March 15, 2019"},{"date_added":"November 1, 2018","rating":"TV-14","release_year":"2008","country":"India","duration":"118 min","type":"Movie","show_id":"70109758","title":"Oye Lucky! Lucky Oye!","listed_in":"Comedies, Dramas, International Movies","description":"Starting as a petty thief, a man rises to become one of the city's biggest operators and carves out the kind of lifestyle he'd once only dreamed of.","director":"Dibakar Banerjee","cast":"Abhay Deol, Paresh Rawal, Neetu Chandra, Archana Puran Singh, Manu Rishi Chadha, Richa Chadda, Anurag Arora, Rajender Sethi, Manjot Singh, Chandan Anand"},{"country":"India","rating":"TV-14","listed_in":"International Movies, Music & Musicals, Romantic Movies","description":"When flashbacks reveal that he's the reincarnation of a man murdered by his wife, rock star Monty sets out to get revenge for the decades-old crime.","date_added":"October 22, 2017","director":"Satish Kaushik","duration":"137 min","type":"Movie","release_year":"2008","show_id":"70109884","cast":"Himesh Reshammiya, Urmila Matondkar, Shweta Kumar, Dino Morea, Raj Babbar, Danny Denzongpa, Gulshan Grover, Rohini Hattangadi, Asrani, Smita Bansal","title":"Karzzzz"},{"type":"Movie","title":"Rock On!!","director":"Abhishek Kapoor","cast":"Farhan Akhtar, Arjun Rampal, Purab Kohli, Luke Kenny, Prachi Desai, Shahana Goswami, Koel Purie","date_added":"December 15, 2019","country":"India","duration":"139 min","release_year":"2008","description":"Four friends hoped that their rock band would be a hit. After breaking up, the band members reunite and take another shot at fulfilling their dream.","listed_in":"Dramas, International Movies, Music & Musicals","rating":"TV-14","show_id":"70110883"},{"title":"Caregiver","rating":"TV-14","listed_in":"Dramas, International Movies","release_year":"2008","cast":"Sharon Cuneta, John Estrada, John Manalo, Rica Peralejo, Jhong Hilario, Saul Reichlin, Matthew Rutherford, Claire Jeater, Makisig Morales, Mickey Ferriols","country":"Philippines","type":"Movie","description":"Sarah leaves her son in the Philippines to reunite with her husband in London, where she struggles personally and professionally as a care-home worker.","director":"Chito S. Roño","date_added":"March 5, 2019","show_id":"70110919","duration":"131 min"},{"type":"Movie","listed_in":"Dramas, International Movies","show_id":"70111162","cast":"Priyanka Chopra, Kangana Ranaut, Mugdha Godse, Arbaaz Khan, Arjan Bajwa, Raj Babbar, Kiran Juneja, Samir Soni","description":"A small-town girl finally realizes her dream of becoming a famous supermodel but soon finds there's a price for her glamorous new life.","date_added":"August 2, 2018","release_year":"2008","director":"Madhur Bhandarkar","duration":"158 min","country":"India","rating":"TV-MA","title":"Fashion"},{"type":"Movie","duration":"128 min","cast":"Sanjay Dutt, Arjun Rampal, Malaika Arora, Aashish Chaudhary, Neha Uberoi, Urmila Matondkar, Manoj Joshi, Daya Shanker Pandey, Pushkar Jog, Kulbhushan Kharbanda","title":"EMI: Liya Hai To Chukana Padega","date_added":"May 15, 2019","description":"A bank hires an enigmatic and unorthodox debt collector to recover money from four borrowers who are unable to pay their loans.","release_year":"2008","rating":"TV-14","director":"Saurabh Kabra","country":"India","show_id":"70111279","listed_in":"Comedies, Dramas, International Movies"},{"rating":"TV-PG","type":"Movie","director":"Kamal Sahani","date_added":"January 30, 2019","country":"India","listed_in":"Dramas, Faith & Spirituality, International Movies","release_year":"2008","title":"Sat Sri Akal","show_id":"70113347","duration":"141 min","cast":"Kimi Verma, Manpreet Singh, Arun Bali, Dolly Minhas, Avtar Gill, Manmeet Singh, Neelu Kohli, Vivek Shaq, Nirmal Rishi, Pooja Tandon","description":"Based on true events, this moving story centers on a Punjabi family whose celebration of their faith endures in the face of conflicting attitudes."},{"rating":"TV-PG","listed_in":"Children & Family Movies, Dramas, International Movies","duration":"119 min","show_id":"70114484","country":"Indonesia","title":"The Rainbow Troops","director":"Riri Riza","description":"Two Indonesian teachers embrace an inspiring crop of gifted young students who've come to study at their crumbling Islamic primary school.","date_added":"October 21, 2018","release_year":"2008","cast":"Cut Mini Theo, Ikranagara, Lukman Sardi, Ario Bayu, Tora Sudiro","type":"Movie"},{"rating":"NR","listed_in":"Dramas, International Movies, Music & Musicals","description":"DJ Ickarus is at the top of his game, dazzling fans and touring the world – until he gets locked in the loony bin after taking a few too many drugs.","duration":"105 min","release_year":"2008","cast":"Paul Kalkbrenner, Rita Lengyel, Corinna Harfouch, Araba Walton, Peter Schneider, Rolf Peter Kahl, Henriette Müller, Udo Kroschwald, Megan Gay, Max Mauff","title":"Berlin Calling","show_id":"70114977","type":"Movie","director":"Hannes Stöhr","date_added":"January 15, 2017","country":"Germany"},{"country":"India","description":"In an effort to honor the family matriarch's dying wish, Urmila and her husband, Shrikant, embark on a quest to find a husband for charismatic yet choosey Sai. But some things are easier said than done.","rating":"TV-14","type":"Movie","cast":"Shreyas Talpade, Subodh Bhave, Sai Tamhankar, Santosh Juvekar, Tushar Dalvi, Bharti Aacharekar","show_id":"70116578","listed_in":"Comedies, Dramas, International Movies","duration":"122 min","director":"Rajeev Patil","release_year":"2008","title":"Sanai Choughade","date_added":"January 1, 2018"},{"title":"The Beast Stalker","director":"Dante Lam","release_year":"2008","duration":"110 min","country":"Hong Kong","date_added":"July 21, 2019","type":"Movie","show_id":"70117354","description":"Feeling guilty after a high-speed chase leaves a girl dead, a determined sergeant pursues the crime boss who triggered the fatal car accident.","rating":"TV-MA","cast":"Nicholas Tse, Nick Cheung, Zhang Jing-chu, Miao Pu, Liu Kai-chi, Philip Keung, Kwok Jing-hung, Sherman Chung, Zhang He, Wong Suet-yin, Wong Sum-yin","listed_in":"Action & Adventure, International Movies"},{"description":"An architect and his wife move into a castle that is slated to become a luxury hotel. But something inside is determined to stop the renovation.","director":"Vikram Bhatt","date_added":"December 15, 2017","release_year":"2008","type":"Movie","rating":"TV-MA","title":"1920","listed_in":"Horror Movies, International Movies, Thrillers","cast":"Rajneesh Duggal, Adah Sharma, Indraneil Sengupta, Anjori Alagh, Rajendranath Zutshi, Vipin Sharma, Amin Hajee, Shri Vallabh Vyas","duration":"143 min","show_id":"70117674","country":"India"},{"listed_in":"Action & Adventure, Dramas, International Movies","date_added":"January 15, 2016","duration":"107 min","rating":"R","country":"Hong Kong, China","title":"Ip Man","show_id":"70118799","type":"Movie","release_year":"2008","director":"Wilson Yip","cast":"Donnie Yen, Simon Yam, Louis Fan, Lam Ka Tung, Xing Yu, Wong You-nam, Chen Zhi Hui, Lynn Hung, Hiroyuki Ikeuchi","description":"An occupying Japanese general challenges Chinese men to duels to prove the superiority of the Japanese, but Ip Man refuses to fight – at first."},{"title":"Connected","release_year":"2008","show_id":"70118801","type":"Movie","country":"China, Hong Kong","cast":"Louis Koo, Barbie Hsu, Nick Cheung, Liu Ye, Louis Fan, Eddie Cheung, Flora Chan, Gong Beibi","director":"Benny Chan","listed_in":"Action & Adventure, International Movies","duration":"111 min","rating":"TV-MA","date_added":"July 21, 2019","description":"In this remake of \"Cellular,\" a debt collector becomes embroiled in intrigue after answering a random phone call from a stranger begging for help."},{"description":"Follow the evolution of the British sketch comedy troupe that redefined humor and shaped an entire generation of American comics.","title":"Monty Python Conquers America","country":"","rating":"TV-MA","listed_in":"Documentaries","show_id":"70118860","date_added":"October 2, 2018","release_year":"2008","director":"Will Yapp","cast":"Graham Chapman, Eric Idle, Terry Jones, Michael Palin, Terry Gilliam, John Cleese","type":"Movie","duration":"55 min"},{"duration":"106 min","cast":"Ai-Ai de las Alas, Shaina Magdayao, Carlo Aquino, Alwyn Uytingco, Eugene Domingo, Deejay Durano, Serena Dalrymple, Jiro Manio, Yuki Kadooka, Cherry Pie Picache, Gloria Diaz","country":"Philippines","type":"Movie","title":"The Only Mother To You All","rating":"TV-PG","listed_in":"Comedies, International Movies","director":"Wenn V. Deramas","description":"Raising her large family alone after her husband's death, Ina searches for work and finally lands the most unlikely job: president of the Philippines.","show_id":"70123648","release_year":"2008","date_added":"February 27, 2019"},{"description":"The lives of a middle-aged soap opera addict, an ambitious career woman, a fervent activist and nine others from different walks of Indian life intersect in Mumbai. But this vibrant melting pot threatens to bubble over with bias and bigotry.","cast":"Anupam Kher, Atul Kulkarni, Aakash Pandey, Milind Gunaji, Perizaad Zorabian, Smiley Suri, Parvin Dabas, Rajit Kapoor, Purab Kohli, Rajpal Yadav, Sarika, Sayaji Shinde, Seema Biswas, Vijay Raaz, Ashwin Mushran, Veerendra Saxena, Siddhant Karnick","rating":"TV-MA","title":"Y.M.I.: Yeh Mera India","country":"India","type":"Movie","duration":"137 min","date_added":"March 1, 2018","director":"N. Chandra","release_year":"2008","listed_in":"Dramas, Independent Movies, International Movies","show_id":"70125935"},{"show_id":"70142437","duration":"2 Seasons","cast":"Skeet Ulrich, Lennie James, Ashley Scott, Kenneth Mitchell, Brad Beyer, April Parker-Jones, Alicia Coppola, Pamela Reed, Bob Stephenson, Gerald McRaney, Clare Carey, Richard Speight Jr., Michael Gaston, Erik Knudsen, Shoshannah Stern, Sprague Grayden","release_year":"2008","listed_in":"Classic & Cult TV, TV Action & Adventure, TV Dramas","date_added":" August 16, 2017","type":"TV Show","rating":"TV-14","country":"United States","title":"Jericho","description":"Jake returns to his Kansas town to collect an inheritance, but a nuclear blast cuts off the outside world and makes him a reluctant leader amid chaos.","director":""},{"cast":"Purav Bhandare, Anupam Kher, Rahul Bose, Victor Banerjee, Ankush Dubey, Rasika Dugal, Rahul Khanna, Sana Shaikh, Dheirya Sonecha, Fatima Sana Shaikh, Sarika","date_added":"July 15, 2018","director":"Santosh Sivan","rating":"TV-14","country":"India","description":"After his family's donkey is confiscated by a moneylender, 8-year-old Tahaan travels across conflict-torn Kashmir to find his beloved pet.","listed_in":"Dramas, International Movies","release_year":"2008","title":"Tahaan","type":"Movie","show_id":"70171835","duration":"95 min"},{"cast":"Yuichi Nakamura, David Matranga, Mai Nakahara, Luci Christian, Ryo Hirohashi, Shelley Calene-Black, Ai Nonaka, Hilary Haag, Akemi Kanda, Brittney Karbowski, Houko Kuwashima, Kaytha Coker, Mamiko Noto, Emily Neves, Daisuke Sakaguchi, Greg Ayres","show_id":"70204963","description":"Maladjusted high school student Tomoya's life begins to change when he befriends his classmate Nagisa and several other eccentric girls.","rating":"TV-PG","release_year":"2008","listed_in":"Anime Series, Teen TV Shows","date_added":" November 1, 2019","title":"CLANNAD","director":"","country":"Japan","type":"TV Show","duration":"2 Seasons"},{"date_added":"","cast":"Yuuka Nanri, Kanako Mitsuhashi, Eri Sendai, Ami Koshimizu, Hidenobu Kiuchi, Mitsuru Miyamoto, Masashi Ebara, Norihiro Inoue, Rie Nakagawa, Masami Iwasaki, Laura Bailey, Luci Christian, Caitlin Glass, Alese Johnson, Monica Rial, Jerry Jewell, Stephanie Young, Mike McFarland","country":"Japan","release_year":"2008","rating":"TV-14","description":"On the surface, the Social Welfare Agency appears to help orphaned schoolgirls, but it's actually turning them into lethal agents.","director":"","duration":"2 Seasons","show_id":"70204989","listed_in":"Anime Series, Crime TV Shows","type":"TV Show","title":"Gunslinger Girl"},{"type":"TV Show","director":"Hayato Date","country":"Japan","duration":"9 Seasons","description":"Guided by the spirit demon within him, orphaned Naruto learns to harness his powers as a ninja in this anime adventure series.","listed_in":"Anime Series, International TV Shows","cast":"Junko Takeuchi, Chie Nakamura, Noriaki Sugiyama, Kazuhiko Inoue, Toshihiko Seki, Hidekatsu Shibata, Masako Katsuki, Nana Mizuki","release_year":"2008","rating":"TV-PG","show_id":"70205012","title":"Naruto","date_added":" September 1, 2019"},{"release_year":"2008","cast":"Masakazu Morita, Fumiko Orikasa, Aya Hirano, Hiroshi Kamiya, Mitsuaki Madono, Ryotaro Okiayu, Kentaro Ito, Shinichiro Miki, Satsuki Yukino, Masaaki Tsukada","director":"Noriyuki Abe","date_added":"October 15, 2016","listed_in":"Action & Adventure, Anime Features, Sci-Fi & Fantasy","type":"Movie","duration":"94 min","description":"When his mind is fogged by a scimitar-weilding stranger, Mayuri destroys his laboratory, unleashing a cloud of reishi that lays waste to the Seiretei.","show_id":"70208801","rating":"NR","country":"Japan","title":"Bleach The Movie: Fade to Black"},{"rating":"TV-Y7-FV","title":"Power Rangers Jungle Fury","director":"","date_added":"January 1, 2016","duration":"1 Season","cast":"Jason Smith, Aljin Abella, Anna Hutchison, David de Lautour, Nikolai Nikolaeff, Sarah Thomson, Bede Skinner, Holly Shanahan, Kelson Henderson, Richard Simpson, Cameron Rhodes, Elisabeth Easther, Mark Wright, Derek Judge","type":"TV Show","listed_in":"Kids' TV","release_year":"2008","show_id":"70213083","description":"The Power Rangers travel to California in search of their new master and find him running a pizza parlor – so they join the staff to be trained.","country":"United States"},{"director":"","release_year":"2008","type":"TV Show","title":"The Legend of Bruce Lee","country":"China","cast":"Danny Chan, Michelle Lang, Ted Duran, Hazen MacIntyre, Luoyong Wang, Natalia Dzyublo, Traci Ann Wolfe, Ke Gai, Zhou Zhou, Yu Chenghui","date_added":"July 7, 2017","show_id":"70228154","listed_in":"International TV Shows, TV Action & Adventure, TV Dramas","description":"The brief but spectacular career of martial arts superstar Bruce Lee is recounted in this drama, starring Danny Chan as the enigmatic and driven Lee.","duration":"1 Season","rating":"NR"},{"date_added":"September 1, 2016","show_id":"70229514","listed_in":"British TV Shows, TV Horror, TV Thrillers","title":"Dead Set","country":"United Kingdom","rating":"TV-MA","director":"","duration":"1 Season","cast":"Jaime Winstone, Andy Nyman, Kevin Eldon, Davina McCall, Warren Brown, Riz Ahmed, Beth Cordingly, Kathleen McDermott, Raj Ghatak","release_year":"2008","description":"While the housemates in the Big Brother house remain oblivious, fast-moving hordes of the undead decimate the studio compound.","type":"TV Show"},{"duration":"1 Season","cast":"Jack Black, Dustin Hoffman, Dennis Haysbert, Paul Scheer, Randall Duk Kim, David Cross, Jessica DiCicco, Jaycee Chan, Angelina Jolie, Seth Rogen, Tony Leondis","title":"DreamWorks Kung Fu Panda Awesome Secrets","listed_in":"Kids' TV, TV Action & Adventure, TV Comedies","director":"","description":"In this pair of adventures, Po tells the story of how masters Thundering Rhino, Storming Ox and Croc met and takes on Shifu's biggest challenge yet.","date_added":"July 1, 2019","type":"TV Show","release_year":"2008","rating":"TV-PG","country":"United States","show_id":"70241791"},{"show_id":"70242630","duration":"1 Season","rating":"TV-PG","release_year":"2008","country":"United States","description":"Shrek celebrates Halloween, Puss in Boots is captured by soldiers, and the gang participates in a kingdom-wide singing competition.","director":"","cast":"Mike Myers, Eddie Murphy, Cameron Diaz, Antonio Banderas, Kristen Schaal, Simon Cowell, Gilles Marini, Charlotte Newhouse, Dean Edwards, Cody Cameron, Christopher Knights, Conrad Vernon","date_added":"August 17, 2012","type":"TV Show","title":"DreamWorks Shrek's Swamp Stories","listed_in":"Kids' TV, TV Action & Adventure, TV Comedies"},{"cast":"John Paul Tremblay, Robb Wells, John Dunsworth, Patrick Roach, Lucy Decoutere, Sarah Dunsworth, Barrie Dunn, Jeanna Harrison, Shelley Thompson, Tyrone Parsons","type":"Movie","title":"Trailer Park Boys: Say Goodnight to the Bad Guys","rating":"TV-MA","date_added":"March 1, 2018","director":"Mike Clattenburg","duration":"47 min","listed_in":"Comedies, Cult Movies","release_year":"2008","show_id":"70304189","description":"A year after the Season 7 finale, the boys are poised to live the good life. But an old enemy throws a wrench in things once again.","country":"Canada"},{"type":"TV Show","description":"At Cross Academy, two student disciplinary committee members are tasked with keeping the peace between a human class and a night class of vampires.","listed_in":"Anime Series, International TV Shows, Romantic TV Shows","release_year":"2008","show_id":"70309457","cast":"Daisuke Kishio, Ezra Weisz, Mamoru Miyano, Vic Mignogna, Yui Horie, Mela Lee, Risa Mizuno, Stephanie Sheh, Junichi Suwabe, Troy Baker, Jun Fukuyama, Bryce Papenbrook, Mai Nakahara, Laura Bailey, Soichiro Hoshi, Steve Staley, Susumu Chiba, Spike Spencer, Hiroki Yasumoto, Travis Willingham, Fumiko Orikasa, Wendee Lee","director":"","date_added":" October 15, 2016","title":"Vampire Knight","rating":"TV-14","duration":"2 Seasons","country":"Japan"},{"rating":"TV-Y7-FV","description":"Aided by tablets found near a downed meteorite, Max, Rex and Zoe race the evil Alpha Gang as they travel the globe in search of living dinosaurs.","listed_in":"Anime Series, Kids' TV","release_year":"2008","type":"TV Show","show_id":"80007912","country":"Japan","director":"","duration":"2 Seasons","cast":"Megumi Matsumoto, Matsuri Mizuguchi, Tomoko Kobashi, Asuka Tanii, Seiko Tamura, Veronica Taylor, Sebastian Arcelus, Kether Donohue, Rachael Lillis, Madeleine Blaustein","date_added":" June 2, 2018","title":"Dinosaur King"},{"description":"One man makes a fateful decision to get involved with a Colombian drug cartel in this series based on a novel by Andrés López López.","director":"","country":"Colombia","title":"El Cartel","type":"TV Show","duration":"1 Season","show_id":"80025923","cast":"Manolo Cardona, Karen Martínez, Robinson Díaz, Diego Cadavid, Fernando Solórzano, Julian Arango, Sandra Reyes, Juan Pablo Raba, Fernando Arévalo","rating":"TV-MA","listed_in":"Crime TV Shows, International TV Shows, Spanish-Language TV Shows","date_added":"August 24, 2018","release_year":"2008"},{"cast":"Carmen Villalobos, Catherine Siachoque, María Fernanda Yépez, Ramiro Meneses, Juan Diego Sánchez, Aylín Mujica, Fabián Ríos, Roberto Mateos","country":"Colombia, Mexico, United States","listed_in":"International TV Shows, Spanish-Language TV Shows, TV Dramas","date_added":"May 15, 2017","release_year":"2008","description":"Inspired by a true story, this TV drama shadows a young Colombian woman who goes to shocking lengths to escape a life of poverty.","director":"","title":"Sin senos no hay paraíso","show_id":"80047031","type":"TV Show","rating":"TV-14","duration":"1 Season"},{"show_id":"80065146","listed_in":"Anime Series, International TV Shows","cast":"Jun Fukuyama, Takahiro Sakurai, Yukana, Ami Koshimizu, Kaori Nazuka, Fumiko Orikasa, Sayaka Ohara, Noriaki Sugiyama, Takahiro Mizushima, Soichiro Hoshi, Yuko Goto","release_year":"2008","date_added":" May 1, 2019","title":"Code Geass: Lelouch of the Rebellion","director":"","description":"A high-schooler who's granted powers to make anyone instantly obedient dons a mask to lead Japan's rebellion against a long-invading Britannia.","type":"TV Show","country":"Japan","rating":"TV-14","duration":"2 Seasons"},{"cast":"Randeep Hooda, Nandana Sen, Jim Boeven, Paresh Rawal, Tom Alter, Vikram Gokhale, Vipin Sharma, Gaurav Dwivedi","listed_in":"Dramas, International Movies","rating":"TV-14","date_added":"May 25, 2018","release_year":"2008","director":"Ketan Mehta","description":"Seeking inspiration, a young 19th-century painter finds a woman who is his love, his muse and his willing subject, but his work becomes controversial.","title":"Colours of Passion","country":"India","duration":"114 min","show_id":"80084666","type":"Movie"},{"release_year":"2008","director":"","description":"Leading astronomers reveal the latest discoveries about death-trap planets, asteroids, comets and other wonders of the cosmos.","country":"United Kingdom","type":"TV Show","listed_in":"British TV Shows, Docuseries, Science & Nature TV","duration":"1 Season","date_added":"August 1, 2016","rating":"TV-G","cast":"","show_id":"80106338","title":"Edge of the Universe"},{"show_id":"80108996","director":"Christopher Martin","description":"In this jailhouse interview, Arthur Shawcross, the Genesee River Killer, shares candid details of his crimes and his surprising family bonds.","country":"United States","title":"Interview with a Serial Killer","type":"Movie","cast":"Arthur Shawcross","release_year":"2008","date_added":"August 1, 2016","duration":"45 min","rating":"TV-14","listed_in":"Documentaries"},{"duration":"1 Season","cast":"Joe Chen, Ethan Juan, Baron Chen, Bianca Bai, Wei-hsun Na, Tan Ai-Chen","rating":"TV-14","show_id":"80109038","release_year":"2008","description":"A young woman's romantic cruise ends in a twist when she gets pregnant after a one-night stand with a rich executive, turning their lives upside down.","director":"","type":"TV Show","date_added":"August 1, 2016","listed_in":"International TV Shows, Romantic TV Shows, TV Comedies","country":"Taiwan","title":"You're My Destiny"},{"cast":"Forbes KB","show_id":"80109248","type":"Movie","title":"Real Crime: Diamond Geezers","rating":"TV-14","description":"In an attempted heist worthy of a Hollywood film, a cadre of criminals sets out to steal the world's largest perfect diamond from a London landmark.","director":"Tom Whitter","date_added":"August 1, 2016","duration":"46 min","release_year":"2008","listed_in":"Documentaries","country":"United Kingdom"},{"release_year":"2008","rating":"TV-MA","show_id":"80113894","description":"This documentary crime series charts the rise of the Irish Mob in America, from urban immigrant poverty to political power and wealth.","director":"","duration":"1 Season","title":"The Irish Mob","listed_in":"Crime TV Shows, Docuseries","type":"TV Show","cast":"Mickey Spillane","date_added":"December 1, 2016","country":""},{"release_year":"2008","title":"Figaro Pho","cast":"Luke Jurevicius","rating":"TV-Y7","country":"United Kingdom","duration":"29 min","description":"Quirky little Figaro has a whole alphabet's worth of phobias. These wordless animated shorts follow his many fears from A to Z.","director":"Luke Jurevicius","date_added":"September 1, 2016","type":"Movie","show_id":"80118841","listed_in":"Children & Family Movies, Comedies"},{"cast":"Berg Lee, Yise Loo, Alvin Wong, Hady, Monday Kang, Ruobing, Wymen Yang, May June, Aenie Wong, Ernest Chong","description":"Young journalists working for a magazine juggle careers, romance and other challenges while reporting on social issues and news stories in Malaysia.","type":"TV Show","show_id":"80136450","title":"Exclusive Edition","duration":"1 Season","listed_in":"International TV Shows, TV Dramas","rating":"TV-14","director":"James Lee","country":"","release_year":"2008","date_added":"August 14, 2017"},{"type":"TV Show","date_added":"November 1, 2017","release_year":"2008","description":"A devious businessman covets his partner's priceless treasure map, while a related murder case calls into question some biological family ties.","listed_in":"Crime TV Shows, International TV Shows, TV Action & Adventure","country":"","title":"The Truth","rating":"TV-14","cast":"Tay Ping Hui, Joanne Peh, Shaun Chen, Rebecca Lim, Zhu Houren, Richard Low","show_id":"80157488","duration":"1 Season","director":""},{"listed_in":"International TV Shows, Stand-Up Comedy & Talk Shows","show_id":"80159732","director":"","country":"Japan","title":"Japanese Style Originator","cast":"Takeo Chii, Hisako Manda, Takahiro Azuma, Kazuya Masuda","type":"TV Show","rating":"TV-G","duration":"1 Season","description":"Find out everything there is to know about Japanese tradition, from food to culture to objects and arts, and the people who are continuing it today.","date_added":"May 1, 2017","release_year":"2008"},{"description":"Acrobatic aliens arrive on spaceships and perform for everyone, but when angry aliens arrive as well, Pocoyo and his friends must now put on a show.","title":"Pocoyo & The Space Circus","show_id":"80235767","date_added":"May 1, 2018","cast":"Stephen Fry, Carys Doyle","duration":"25 min","country":"Spain","release_year":"2008","listed_in":"Movies","director":"Alfonso Rodríguez","type":"Movie","rating":"TV-G"},{"director":"Note Chern-Yim","listed_in":"Comedies, Faith & Spirituality, International Movies","country":"Thailand","type":"Movie","show_id":"80999990","date_added":"July 30, 2018","duration":"92 min","title":"Holy Man 2","cast":"Apisit Opasaimlikit, Suthep Po-ngam, Phichet Iamchaonaa, Note Chern-Yim","release_year":"2008","description":"Former rap musician Joey Boy is now a monk who takes Father Teng's place at his rural temple, where a crisis develops involving a nearby stone quarry.","rating":"TV-14"},{"show_id":"81030197","release_year":"2008","director":"Liu Jiang","listed_in":"Dramas, International Movies","cast":"Wenpei Ju, Fan Wei, Liu Hua, Qianyuan Wang, Ren Zhengbin, He Jiang","date_added":"December 1, 2018","country":"China","rating":"TV-MA","title":"Set Off","type":"Movie","description":"When a restaurant owner in Cyprus returns to Beijing to sign divorce papers, a drunk woman he encounters triggers a string of mishaps.","duration":"96 min"},{"type":"Movie","duration":"120 min","director":"Kabir Bhatia, Titien Wattimena","date_added":"November 30, 2018","listed_in":"Dramas, International Movies, Romantic Movies","cast":"Acha Septriasa, Darius Sinathrya, Fauzi Baadila, Irwansyah, Laudya Cynthia Bella, Luna Maya, Sophan Sophiaan, Surya Saputra, Widyawati, Wulan Guritno","description":"In Jakarta, five couples of varying ages and backgrounds experience the different stages of romantic love, from its giddy start to its painful end.","title":"Love","show_id":"81033200","rating":"TV-PG","release_year":"2008","country":"Indonesia"},{"listed_in":"Comedies, Dramas, International Movies","rating":"TV-14","title":"Because of Soccer","release_year":"2008","duration":"75 min","cast":"Herjunot Ali, Winky Wiryawan, Erly Ashy, Laura Basuki, Tarzan, Aida Nurmala, Otto Djauhari, Indra Herlambang","country":"Indonesia","description":"After losing a World Cup bet, two hapless buddies must use their wits to pay off their debt to a big Jakarta bookie in this action-packed comedy.","director":"Agasyah Karim, Khalid Kashogi","type":"Movie","date_added":"December 8, 2018","show_id":"81033201"},{"cast":"Gina Yashere","director":"","type":"Movie","show_id":"81045517","date_added":"December 31, 2018","rating":"TV-MA","listed_in":"Stand-Up Comedy","country":"United Kingdom","duration":"58 min","release_year":"2008","description":"Standup comedian and \"Daily Show\" correspondent Gina Yashere delivers a sharp set of wry observations on the environment, money and more.","title":"Gina Yashere: Skinny B*tch"},{"release_year":"2008","type":"Movie","cast":"Tim Minchin","title":"Tim Minchin: So F**king Rock","duration":"127 min","show_id":"81045530","description":"Comedic pianist Tim Minchin performs a host of his catchy songs that touch on everything from the Middle East to the healing power of canvas bags.","date_added":"December 31, 2018","rating":"TV-MA","country":"United Kingdom","listed_in":"Music & Musicals, Stand-Up Comedy","director":"Matt Askem"},{"description":"Polygamy, piety and personal principles collide for a charming and congenial young university student struggling in a four-way love triangle.","country":"Indonesia","type":"Movie","cast":"Fedi Nuril, Rianti Cartwright, Carissa Putri, Melanie Putria, Zaskia Adya Mecca, Surya Saputra, Dennis Adhiswara, Oka Antara","date_added":"March 27, 2019","director":"Hanung Bramantyo","listed_in":"Dramas, International Movies, Romantic Movies","rating":"TV-14","show_id":"81047897","duration":"126 min","title":"Verses of Love","release_year":"2008"}]}